codedFixedValue/base/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;
alpha   -0.0005;
Lx 100;
Lz  #calc "1.0 + $Lx*$alpha";

vertices
(
    (0  0 0)
    ($Lx  0 0)
    ($Lx 0.1 0)
    (0 0.1 0)

    (0  0  1)
    ($Lx  0  $Lz)
    ($Lx 0.1  $Lz)
    (0 0.1  1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1000 1 10) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    walls
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }

    centreline
    {
        type symmetryPlane;
        faces
        (
            (0 1 2 3)

        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (2 3 7 6)
            (0 1 5 4)

        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
